'''
3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц
(зима, весна, лето, осень). Напишите решения через list и через dict.
'''
month = int(input('Введите месяц в виде целого числа от 1 до 12: '))

winter = [12, 1, 2]
spring = [3, 4, 5]
summer = [6, 7, 8]
autumn = [9, 10, 11]

print('Решение через list: ')
if month in winter:
    print('Этот зима!')
elif month in spring:
    print('Этот весна!')
elif month in summer:
    print('Это лето!')
elif month in autumn:
    print('Это осень!')
else:
    print('Такого месяца нет')

season = {
    1: 'зима',
    2: 'зима',
    3: 'весна',
    4: 'весна',
    5: 'весна',
    6: 'лето',
    7: 'лето',
    8: 'лето',
    9: 'осень',
    10: 'осень',
    11: 'осень',
    12: 'зима'
}

print('Решение через dict: ')
print(f'Это {season.get(month)}!')

print('Решение через объединение lists в dict: ')

month_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
season_list = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'осень',
               'зима']

season_dict = dict(zip(month_list, season_list))
print(f'Это {season_dict.get(month)}!')

#  -------------------------------------------------------- 3 ----------------------------------------------------------


month = int(input("Введите интересующий вас месяц года от 1 до 12: "))

month_dict = {1: "январь", 2: "февраль", 3: "март", 4: "апрель", 5: "май", 6: "июнь", 7: "июль", 8: "август",
              9: "сентябрь", 10: "октябрь", 11: "ноябрь", 12: "декабрь"}

month_list = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь",
              "ноябрь", "декабрь"]

for key in month_dict:
    if key == month:
        print(f"{month}-й месяц года - это {month_dict[key]}")
        print(f"{month}-й месяц года - это {month_list[month - 1]}")
    if month not in month_dict.keys():
        print("Wrong number.")
        break


#  ------------------------------------------- вариант решения ---------------------------------------------------------


user_month = input('Введиде номер месяца от 1 до 12: ')
while True:
    if user_month.isdigit() and 0 <= int(user_month) <= 12:
        season_1 = ['зима', 'весна', 'лето', 'осень', 'зима']
        season_2 = {0: 'зима', 1: 'весна', 2: 'лето', 3: 'осень', 4: 'зима'}
        print(f'Список сезонов - {season_1[int(user_month) // 3]}\nСловарь сезонов - {season_2[int(user_month) // 3]}')
    else:
        print("Error!!!")
    break